import { Component } from '@angular/core';

interface FaqItem {
  question: string;
  answer: string[];
  expanded: boolean;
}

@Component({
  selector: 'app-faq',
  templateUrl: './faq.component.html',
  styleUrl: './faq.component.css'
})
export class FaqComponent {
  faqList: FaqItem[] = [
    { question: 'اشنو لي يخليني نشري الدورة ديالك ؟', answer: ['كنقدمو ليك فالدورة ديالنا تدريب احترافي كتكون من 3 أجزاء مدتها 45 يوم','  النظري: كنقدمو فيه كل مكتحتاج باش تولي متداول محترف بإستعمال التحليل الموجي: الموجة الدافعة…التصحيح...الزيادة في الزخم...شرح النماذج الأربعة...إستراتيجية...الذمج بين الفريمات...شرح طريقة تحديد الأهداف...نظرية التقفيل...طريقة التداول مع الاخبار...إدارة المخاطر','التطبيقي: اي حاجة كانشوفوها فالنظري كنطبقوها على الشارت و كانشوفو بزاف ديال الأمثلة تا كنفهموها مزيان','التتبع: أهم مرحلة فهاد الدورة. هنا كنشوفو خدمتك و كنتبعو معاك بشكل مدقق أغلاط لي كتقوم بيها وكنصححوها'], expanded: false },
    { question: 'سمعت أنه لي دخل للدورة ديالكم ومستافدش كترجعو ليه فلوسو ؟', answer: ['صحيح ولكن وفق شرط معين لي هو خصك تحضر جميع الحصص لأن سمعتنا أهم من المال '], expanded: false },
    { question: 'الدورة أونلاين أو حضورية ؟ ', answer: [' الدورة تقدم أونلاين و الحصص كتكون مباشرةعن طريق التطبيق زووم باش كيمكن لك تسول ونجاوبوك. وأيضا كتكون مسجلة بالنسبة لا كيتعذر عليه الحضور'], expanded: false },
    { question: 'الدورة واش صالحة للمبتدئين ؟ ', answer: ['لا ضروري تكون عندك فكرة على المجال وطالق يديك شوية فالشارت'], expanded: false },
    { question: ' بالنسبة لمرحلة التتبع كيفاش كدوز ', answer: ['كتكون فيها 5 حصص كافية تعرف على أخطأك','كتفتح حساب تجريبي وكتديرو تحليل لبعض الأسواق وكنطلع واحد بواحد كناقش معاه اذا كان عندو شيحاجة خاطئة كانقوم بتصحيحها'], expanded: false },
    { question: 'الدورة شحال كيكون فيها من طالب ؟ ', answer: ['العدد محدود مكيتعداش 15 الشخص هذا كيساعدنا أننا يكون عندنا وقت لكل واحد فيكم'], expanded: false },
    { question: 'اشنو التحليل لي كتعتامدو عليه وواش صالح لجميع الأسواق ؟ ', answer: ['كنشتغلو بالتحليل الموجي و صالح ن جميع الأسواق الفوركس ،الكريبتو،الأسهم…'], expanded: false },
    { question: 'فاش كتسالي مدة الدورة كيتقطع بيكم الاتصال ؟ ', answer: ['كتدخل لمجموعة خاصة على التيليغرام و كاتبقاو تشاركو مع بعضكم تما التحليلات ديالكم و ملي كايكون شي إشكال كنفتح لايف و كانشرحوه'], expanded: false },
  ];

  toggleAnswer(index: number) {
    var test=!this.faqList[index].expanded;
    this.faqList.forEach(element => {
        element.expanded=false;
    });
    this.faqList[index].expanded = test;
  }
}
